; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-36)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
)
)
)

; plan
1. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 5 of 36
2. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 5 of 36
3. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 6 of 36
4. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 6 of 36
5. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 6 of 36
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 36
7. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 7 of 36
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 36
9. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 7 of 36
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 36
11. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 8 of 36
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 36
13. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 8 of 36
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 36
15. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 9 of 36
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 36
17. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 9 of 36
18. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 36
19. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 10 of 36
20. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 36
21. (pick ball36 rooma left)
   deleted: (at ball36 rooma) (free left)
   added: (carry ball36 left)
   goals met: 10 of 36
22. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 10 of 36
23. (drop ball36 room6 left)
   deleted: (carry ball36 left)
   added: (at ball36 room6) (free left)
   goals met: 11 of 36
24. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 11 of 36
25. (pick ball35 rooma left)
   deleted: (at ball35 rooma) (free left)
   added: (carry ball35 left)
   goals met: 11 of 36
26. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 11 of 36
27. (drop ball35 room6 left)
   deleted: (carry ball35 left)
   added: (at ball35 room6) (free left)
   goals met: 12 of 36
28. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 12 of 36
29. (pick ball34 rooma left)
   deleted: (at ball34 rooma) (free left)
   added: (carry ball34 left)
   goals met: 12 of 36
30. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 12 of 36
31. (drop ball34 room6 left)
   deleted: (carry ball34 left)
   added: (at ball34 room6) (free left)
   goals met: 13 of 36
32. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 13 of 36
33. (pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 13 of 36
34. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 13 of 36
35. (drop ball33 room6 left)
   deleted: (carry ball33 left)
   added: (at ball33 room6) (free left)
   goals met: 14 of 36
36. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 14 of 36
37. (pick ball32 rooma left)
   deleted: (at ball32 rooma) (free left)
   added: (carry ball32 left)
   goals met: 14 of 36
38. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 14 of 36
39. (drop ball32 room6 left)
   deleted: (carry ball32 left)
   added: (at ball32 room6) (free left)
   goals met: 15 of 36
40. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 15 of 36
41. (pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 15 of 36
42. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 15 of 36
43. (drop ball31 room6 left)
   deleted: (carry ball31 left)
   added: (at ball31 room6) (free left)
   goals met: 16 of 36
44. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 16 of 36
45. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 16 of 36
46. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 16 of 36
47. (drop ball30 room6 left)
   deleted: (carry ball30 left)
   added: (at ball30 room6) (free left)
   goals met: 17 of 36
48. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 17 of 36
49. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 36
50. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 17 of 36
51. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 17 of 36
52. (drop ball29 room5 left)
   deleted: (carry ball29 left)
   added: (at ball29 room5) (free left)
   goals met: 18 of 36
53. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 18 of 36
54. (pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 18 of 36
55. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 18 of 36
56. (drop ball28 room5 left)
   deleted: (carry ball28 left)
   added: (at ball28 room5) (free left)
   goals met: 19 of 36
57. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 19 of 36
58. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 19 of 36
59. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 19 of 36
60. (drop ball27 room5 left)
   deleted: (carry ball27 left)
   added: (at ball27 room5) (free left)
   goals met: 20 of 36
61. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 20 of 36
62. (pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 20 of 36
63. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 20 of 36
64. (drop ball26 room5 left)
   deleted: (carry ball26 left)
   added: (at ball26 room5) (free left)
   goals met: 21 of 36
65. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 21 of 36
66. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 21 of 36
67. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 21 of 36
68. (drop ball25 room5 left)
   deleted: (carry ball25 left)
   added: (at ball25 room5) (free left)
   goals met: 22 of 36
69. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 22 of 36
70. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 22 of 36
71. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 22 of 36
72. (drop ball24 room5 left)
   deleted: (carry ball24 left)
   added: (at ball24 room5) (free left)
   goals met: 23 of 36
73. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 23 of 36
74. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 23 of 36
75. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 23 of 36
76. (drop ball23 room5 left)
   deleted: (carry ball23 left)
   added: (at ball23 room5) (free left)
   goals met: 24 of 36
77. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 24 of 36
78. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 24 of 36
79. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 24 of 36
80. (drop ball22 room5 left)
   deleted: (carry ball22 left)
   added: (at ball22 room5) (free left)
   goals met: 25 of 36
81. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 25 of 36
82. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 36
83. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 25 of 36
84. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 25 of 36
85. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 26 of 36
86. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 26 of 36
87. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 26 of 36
88. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 26 of 36
89. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 27 of 36
90. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 27 of 36
91. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 27 of 36
92. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 27 of 36
93. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 28 of 36
94. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 28 of 36
95. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 28 of 36
96. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 28 of 36
97. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 29 of 36
98. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 29 of 36
99. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 29 of 36
100. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 29 of 36
101. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 30 of 36
102. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 30 of 36
103. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 30 of 36
104. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 30 of 36
105. (drop ball16 room4 left)
   deleted: (carry ball16 left)
   added: (at ball16 room4) (free left)
   goals met: 31 of 36
106. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 31 of 36
107. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 31 of 36
108. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 31 of 36
109. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 32 of 36
110. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 32 of 36
111. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 36
112. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 32 of 36
113. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 32 of 36
114. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 33 of 36
115. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 33 of 36
116. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 33 of 36
117. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 33 of 36
118. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 34 of 36
119. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 34 of 36
120. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 36
121. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 34 of 36
122. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 36
123. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 35 of 36
124. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 35 of 36
125. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 35 of 36
126. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 35 of 36
127. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 36 of 36
